zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_MRCC.h
/*
** ###################################################################
**     Processors:          MCXA286VASR
**                          MCXA286VLL
**                          MCXA286VLQ
**                          MCXA286VPN
**                          MCXA287VASR
**                          MCXA287VLL
**                          MCXA287VLQ
**                          MCXA287VPN
**                          MCXA456VASR
**                          MCXA456VLL
**                          MCXA456VLQ
**                          MCXA456VPN
**                          MCXA457VASR
**                          MCXA457VLL
**                          MCXA457VLQ
**                          MCXA457VPN
**                          MCXA536VLL
**                          MCXA536VLQ
**                          MCXA536VPN
**                          MCXA537VLL
**                          MCXA537VLQ
**                          MCXA537VPN
**                          MCXA556BVPN
**                          MCXA556VPN
**                          MCXA557BVPN
**                          MCXA557VPN
**                          MCXA566VLL
**                          MCXA566VLQ
**                          MCXA566VPN
**                          MCXA567VLL
**                          MCXA567VLQ
**                          MCXA567VPN
**                          MCXA577VLL
**                          MCXA577VLQ
**                          MCXA577VPN
**
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b260708
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MRCC
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-03-26)
**         Initial version based on Rev1 DraftC RM
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_MRCC.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for MRCC
 *
 * CMSIS Peripheral Access Layer for MRCC
 */

#if !defined(PERI_MRCC_H_)
#define PERI_MRCC_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXA286VASR) || defined(CPU_MCXA286VLL) || defined(CPU_MCXA286VLQ) || defined(CPU_MCXA286VPN))
#include "MCXA286_COMMON.h"
#elif (defined(CPU_MCXA287VASR) || defined(CPU_MCXA287VLL) || defined(CPU_MCXA287VLQ) || defined(CPU_MCXA287VPN))
#include "MCXA287_COMMON.h"
#elif (defined(CPU_MCXA456VASR) || defined(CPU_MCXA456VLL) || defined(CPU_MCXA456VLQ) || defined(CPU_MCXA456VPN))
#include "MCXA456_COMMON.h"
#elif (defined(CPU_MCXA457VASR) || defined(CPU_MCXA457VLL) || defined(CPU_MCXA457VLQ) || defined(CPU_MCXA457VPN))
#include "MCXA457_COMMON.h"
#elif (defined(CPU_MCXA536VLL) || defined(CPU_MCXA536VLQ) || defined(CPU_MCXA536VPN))
#include "MCXA536_COMMON.h"
#elif (defined(CPU_MCXA537VLL) || defined(CPU_MCXA537VLQ) || defined(CPU_MCXA537VPN))
#include "MCXA537_COMMON.h"
#elif (defined(CPU_MCXA556BVPN) || defined(CPU_MCXA556VPN))
#include "MCXA556_COMMON.h"
#elif (defined(CPU_MCXA557BVPN) || defined(CPU_MCXA557VPN))
#include "MCXA557_COMMON.h"
#elif (defined(CPU_MCXA566VLL) || defined(CPU_MCXA566VLQ) || defined(CPU_MCXA566VPN))
#include "MCXA566_COMMON.h"
#elif (defined(CPU_MCXA567VLL) || defined(CPU_MCXA567VLQ) || defined(CPU_MCXA567VPN))
#include "MCXA567_COMMON.h"
#elif (defined(CPU_MCXA577VLL) || defined(CPU_MCXA577VLQ) || defined(CPU_MCXA577VPN))
#include "MCXA577_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- MRCC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MRCC_Peripheral_Access_Layer MRCC Peripheral Access Layer
 * @{
 */

/** MRCC - Register Layout Typedef */
typedef struct {
  __IO uint32_t MRCC_GLB_RST0;                     /**< Peripheral Reset Control 0, offset: 0x0 */
  __O  uint32_t MRCC_GLB_RST0_SET;                 /**< Peripheral Reset Control Set 0, offset: 0x4 */
  __O  uint32_t MRCC_GLB_RST0_CLR;                 /**< Peripheral Reset Control Clear 0, offset: 0x8 */
       uint8_t RESERVED_0[4];
  __IO uint32_t MRCC_GLB_RST1;                     /**< Peripheral Reset Control 1, offset: 0x10 */
  __O  uint32_t MRCC_GLB_RST1_SET;                 /**< Peripheral Reset Control Set 1, offset: 0x14 */
  __O  uint32_t MRCC_GLB_RST1_CLR;                 /**< Peripheral Reset Control Clear 1, offset: 0x18 */
       uint8_t RESERVED_1[4];
  __IO uint32_t MRCC_GLB_RST2;                     /**< Peripheral Reset Control 2, offset: 0x20 */
  __O  uint32_t MRCC_GLB_RST2_SET;                 /**< Peripheral Reset Control Set 2, offset: 0x24 */
  __O  uint32_t MRCC_GLB_RST2_CLR;                 /**< Peripheral Reset Control Clear 2, offset: 0x28 */
       uint8_t RESERVED_2[4];
  __IO uint32_t MRCC_GLB_RST3;                     /**< Peripheral Reset Control 3, offset: 0x30 */
  __O  uint32_t MRCC_GLB_RST3_SET;                 /**< Peripheral Reset Control Set 3, offset: 0x34 */
  __O  uint32_t MRCC_GLB_RST3_CLR;                 /**< Peripheral Reset Control Clear 3, offset: 0x38 */
       uint8_t RESERVED_3[4];
  __IO uint32_t MRCC_GLB_RST4;                     /**< Peripheral Reset Control 4, offset: 0x40 */
  __O  uint32_t MRCC_GLB_RST4_SET;                 /**< Peripheral Reset Control Set 4, offset: 0x44 */
  __O  uint32_t MRCC_GLB_RST4_CLR;                 /**< Peripheral Reset Control Clear 4, offset: 0x48 */
       uint8_t RESERVED_4[20];
  __IO uint32_t MRCC_GLB_CC0;                      /**< AHB Clock Control 0, offset: 0x60 */
  __O  uint32_t MRCC_GLB_CC0_SET;                  /**< AHB Clock Control Set 0, offset: 0x64 */
  __O  uint32_t MRCC_GLB_CC0_CLR;                  /**< AHB Clock Control Clear 0, offset: 0x68 */
       uint8_t RESERVED_5[4];
  __IO uint32_t MRCC_GLB_CC1;                      /**< AHB Clock Control 1, offset: 0x70 */
  __O  uint32_t MRCC_GLB_CC1_SET;                  /**< AHB Clock Control Set 1, offset: 0x74 */
  __O  uint32_t MRCC_GLB_CC1_CLR;                  /**< AHB Clock Control Clear 1, offset: 0x78 */
       uint8_t RESERVED_6[4];
  __IO uint32_t MRCC_GLB_CC2;                      /**< AHB Clock Control 2, offset: 0x80 */
  __O  uint32_t MRCC_GLB_CC2_SET;                  /**< AHB Clock Control Set 2, offset: 0x84 */
  __O  uint32_t MRCC_GLB_CC2_CLR;                  /**< AHB Clock Control Clear 2, offset: 0x88 */
       uint8_t RESERVED_7[4];
  __IO uint32_t MRCC_GLB_CC3;                      /**< AHB Clock Control 3, offset: 0x90 */
  __O  uint32_t MRCC_GLB_CC3_SET;                  /**< AHB Clock Control Set 3, offset: 0x94 */
  __O  uint32_t MRCC_GLB_CC3_CLR;                  /**< AHB Clock Control Clear 3, offset: 0x98 */
       uint8_t RESERVED_8[4];
  __IO uint32_t MRCC_GLB_CC4;                      /**< AHB Clock Control 4, offset: 0xA0 */
  __O  uint32_t MRCC_GLB_CC4_SET;                  /**< AHB Clock Control Set 4, offset: 0xA4 */
  __O  uint32_t MRCC_GLB_CC4_CLR;                  /**< AHB Clock Control Clear 4, offset: 0xA8 */
       uint8_t RESERVED_9[20];
  __IO uint32_t MRCC_GLB_ACC0;                     /**< Control Automatic Clock Gating 0, offset: 0xC0 */
  __IO uint32_t MRCC_GLB_ACC1;                     /**< Control Automatic Clock Gating 1, offset: 0xC4 */
  __IO uint32_t MRCC_GLB_ACC2;                     /**< Control Automatic Clock Gating 2, offset: 0xC8 */
  __IO uint32_t MRCC_GLB_ACC3;                     /**< Control Automatic Clock Gating 3, offset: 0xCC */
  __IO uint32_t MRCC_GLB_ACC4;                     /**< Control Automatic Clock Gating 4, offset: 0xD0 */
       uint8_t RESERVED_10[44];
  __IO uint32_t MRCC_I3C0_FCLK_CLKSEL;             /**< I3C0_FCLK clock selection control, offset: 0x100 */
  __IO uint32_t MRCC_I3C0_FCLK_CLKDIV;             /**< I3C0_FCLK clock divider control, offset: 0x104 */
  __IO uint32_t MRCC_I3C1_FCLK_CLKSEL;             /**< I3C1_FCLK clock selection control, offset: 0x108 */
  __IO uint32_t MRCC_I3C1_FCLK_CLKDIV;             /**< I3C1_FCLK clock divider control, offset: 0x10C */
  __IO uint32_t MRCC_CTIMER0_CLKSEL;               /**< CTIMER0 clock selection control, offset: 0x110 */
  __IO uint32_t MRCC_CTIMER0_CLKDIV;               /**< CTIMER0 clock divider control, offset: 0x114 */
  __IO uint32_t MRCC_CTIMER1_CLKSEL;               /**< CTIMER1 clock selection control, offset: 0x118 */
  __IO uint32_t MRCC_CTIMER1_CLKDIV;               /**< CTIMER1 clock divider control, offset: 0x11C */
  __IO uint32_t MRCC_CTIMER2_CLKSEL;               /**< CTIMER2 clock selection control, offset: 0x120 */
  __IO uint32_t MRCC_CTIMER2_CLKDIV;               /**< CTIMER2 clock divider control, offset: 0x124 */
  __IO uint32_t MRCC_CTIMER3_CLKSEL;               /**< CTIMER3 clock selection control, offset: 0x128 */
  __IO uint32_t MRCC_CTIMER3_CLKDIV;               /**< CTIMER3 clock divider control, offset: 0x12C */
  __IO uint32_t MRCC_CTIMER4_CLKSEL;               /**< CTIMER4 clock selection control, offset: 0x130 */
  __IO uint32_t MRCC_CTIMER4_CLKDIV;               /**< CTIMER4 clock divider control, offset: 0x134 */
       uint8_t RESERVED_11[4];
  __IO uint32_t MRCC_WWDT0_CLKDIV;                 /**< WWDT0 clock divider control, offset: 0x13C */
  __IO uint32_t MRCC_WWDT1_CLKSEL;                 /**< WWDT1 clock selection control, offset: 0x140 */
  __IO uint32_t MRCC_WWDT1_CLKDIV;                 /**< WWDT1 clock divider control, offset: 0x144 */
  __IO uint32_t MRCC_E1588_CLKSEL;                 /**< E1588 clock selection control, offset: 0x148 */
  __IO uint32_t MRCC_E1588_CLKDIV;                 /**< E1588 clock divider control, offset: 0x14C */
  __IO uint32_t MRCC_RMII_CLKSEL;                  /**< RMII clock selection control, offset: 0x150 */
  __IO uint32_t MRCC_RMII_CLKDIV;                  /**< RMII clock divider control, offset: 0x154 */
  __IO uint32_t MRCC_ESPI0_CLKSEL;                 /**< ESPI0 clock selection control, offset: 0x158 */
  __IO uint32_t MRCC_ESPI0_CLKDIV;                 /**< ESPI0 clock divider control, offset: 0x15C */
  __IO uint32_t MRCC_FLEXSPI0_CLKSEL;              /**< FLEXSPI0 clock selection control, offset: 0x160 */
  __IO uint32_t MRCC_FLEXSPI0_CLKDIV;              /**< FLEXSPI0 clock divider control, offset: 0x164 */
  __IO uint32_t MRCC_LPSPI2_CLKSEL;                /**< LPSPI2 clock selection control, offset: 0x168 */
  __IO uint32_t MRCC_LPSPI2_CLKDIV;                /**< LPSPI2 clock divider control, offset: 0x16C */
  __IO uint32_t MRCC_LPSPI3_CLKSEL;                /**< LPSPI3 clock selection control, offset: 0x170 */
  __IO uint32_t MRCC_LPSPI3_CLKDIV;                /**< LPSPI3 clock divider control, offset: 0x174 */
  __IO uint32_t MRCC_LPSPI4_CLKSEL;                /**< LPSPI4 clock selection control, offset: 0x178 */
  __IO uint32_t MRCC_LPSPI4_CLKDIV;                /**< LPSPI4 clock divider control, offset: 0x17C */
  __IO uint32_t MRCC_LPSPI5_CLKSEL;                /**< LPSPI5 clock selection control, offset: 0x180 */
  __IO uint32_t MRCC_LPSPI5_CLKDIV;                /**< LPSPI5 clock divider control, offset: 0x184 */
  __IO uint32_t MRCC_T1S0_CLKSEL;                  /**< T1S0 clock selection control, offset: 0x188 */
  __IO uint32_t MRCC_T1S0_CLKDIV;                  /**< T1S0 clock divider control, offset: 0x18C */
  __IO uint32_t MRCC_USB1_CLKSEL;                  /**< USB1 clock selection control, offset: 0x190 */
       uint8_t RESERVED_12[4];
  __IO uint32_t MRCC_USB1_PHY_CLKSEL;              /**< USB1_PHY clock selection control, offset: 0x198 */
  __IO uint32_t MRCC_USB1_PHY_CLKDIV;              /**< USB1_PHY clock divider control, offset: 0x19C */
  __IO uint32_t MRCC_FLEXIO0_CLKSEL;               /**< FLEXIO0 clock selection control, offset: 0x1A0 */
  __IO uint32_t MRCC_FLEXIO0_CLKDIV;               /**< FLEXIO0 clock divider control, offset: 0x1A4 */
  __IO uint32_t MRCC_LPI2C0_CLKSEL;                /**< LPI2C0 clock selection control, offset: 0x1A8 */
  __IO uint32_t MRCC_LPI2C0_CLKDIV;                /**< LPI2C0 clock divider control, offset: 0x1AC */
  __IO uint32_t MRCC_LPI2C1_CLKSEL;                /**< LPI2C1 clock selection control, offset: 0x1B0 */
  __IO uint32_t MRCC_LPI2C1_CLKDIV;                /**< LPI2C1 clock divider control, offset: 0x1B4 */
  __IO uint32_t MRCC_LPSPI0_CLKSEL;                /**< LPSPI0 clock selection control, offset: 0x1B8 */
  __IO uint32_t MRCC_LPSPI0_CLKDIV;                /**< LPSPI0 clock divider control, offset: 0x1BC */
  __IO uint32_t MRCC_LPSPI1_CLKSEL;                /**< LPSPI1 clock selection control, offset: 0x1C0 */
  __IO uint32_t MRCC_LPSPI1_CLKDIV;                /**< LPSPI1 clock divider control, offset: 0x1C4 */
  __IO uint32_t MRCC_I3C2_FCLK_CLKSEL;             /**< I3C2_FCLK clock selection control, offset: 0x1C8 */
  __IO uint32_t MRCC_I3C2_FCLK_CLKDIV;             /**< I3C2_FCLK clock divider control, offset: 0x1CC */
  __IO uint32_t MRCC_LPUART0_CLKSEL;               /**< LPUART0 clock selection control, offset: 0x1D0 */
  __IO uint32_t MRCC_LPUART0_CLKDIV;               /**< LPUART0 clock divider control, offset: 0x1D4 */
  __IO uint32_t MRCC_LPUART1_CLKSEL;               /**< LPUART1 clock selection control, offset: 0x1D8 */
  __IO uint32_t MRCC_LPUART1_CLKDIV;               /**< LPUART1 clock divider control, offset: 0x1DC */
  __IO uint32_t MRCC_LPUART2_CLKSEL;               /**< LPUART2 clock selection control, offset: 0x1E0 */
  __IO uint32_t MRCC_LPUART2_CLKDIV;               /**< LPUART2 clock divider control, offset: 0x1E4 */
  __IO uint32_t MRCC_LPUART3_CLKSEL;               /**< LPUART3 clock selection control, offset: 0x1E8 */
  __IO uint32_t MRCC_LPUART3_CLKDIV;               /**< LPUART3 clock divider control, offset: 0x1EC */
  __IO uint32_t MRCC_LPUART4_CLKSEL;               /**< LPUART4 clock selection control, offset: 0x1F0 */
  __IO uint32_t MRCC_LPUART4_CLKDIV;               /**< LPUART4 clock divider control, offset: 0x1F4 */
  __IO uint32_t MRCC_LPTMR0_CLKSEL;                /**< LPTMR0 clock selection control, offset: 0x1F8 */
  __IO uint32_t MRCC_LPTMR0_CLKDIV;                /**< LPTMR0 clock divider control, offset: 0x1FC */
  __IO uint32_t MRCC_OSTIMER0_CLKSEL;              /**< OSTIMER0 clock selection control, offset: 0x200 */
       uint8_t RESERVED_13[4];
  __IO uint32_t MRCC_ADC_CLKSEL;                   /**< ADCx clock selection control, offset: 0x208 */
  __IO uint32_t MRCC_ADC_CLKDIV;                   /**< ADCx clock divider control, offset: 0x20C */
       uint8_t RESERVED_14[4];
  __IO uint32_t MRCC_CMP0_FUNC_CLKDIV;             /**< CMP0_FUNC clock divider control, offset: 0x214 */
  __IO uint32_t MRCC_CMP0_RR_CLKSEL;               /**< CMP0_RR clock selection control, offset: 0x218 */
  __IO uint32_t MRCC_CMP0_RR_CLKDIV;               /**< CMP0_RR clock divider control, offset: 0x21C */
  __IO uint32_t MRCC_DAC0_CLKSEL;                  /**< DAC0 clock selection control, offset: 0x220 */
  __IO uint32_t MRCC_DAC0_CLKDIV;                  /**< DAC0 clock divider control, offset: 0x224 */
  __IO uint32_t MRCC_DAC1_CLKSEL;                  /**< DAC1 clock selection control, offset: 0x228 */
  __IO uint32_t MRCC_DAC1_CLKDIV;                  /**< DAC1 clock divider control, offset: 0x22C */
  __IO uint32_t MRCC_TSI0_CLKSEL;                  /**< TSI0 clock selection control, offset: 0x230 */
  __IO uint32_t MRCC_TSI0_CLKDIV;                  /**< TSI0 clock divider control, offset: 0x234 */
  __IO uint32_t MRCC_FLEXCAN0_CLKSEL;              /**< FLEXCAN0 clock selection control, offset: 0x238 */
  __IO uint32_t MRCC_FLEXCAN0_CLKDIV;              /**< FLEXCAN0 clock divider control, offset: 0x23C */
  __IO uint32_t MRCC_FLEXCAN1_CLKSEL;              /**< FLEXCAN1 clock selection control, offset: 0x240 */
  __IO uint32_t MRCC_FLEXCAN1_CLKDIV;              /**< FLEXCAN1 clock divider control, offset: 0x244 */
  __IO uint32_t MRCC_LPI2C2_CLKSEL;                /**< LPI2C2 clock selection control, offset: 0x248 */
  __IO uint32_t MRCC_LPI2C2_CLKDIV;                /**< LPI2C2 clock divider control, offset: 0x24C */
  __IO uint32_t MRCC_LPI2C3_CLKSEL;                /**< LPI2C3 clock selection control, offset: 0x250 */
  __IO uint32_t MRCC_LPI2C3_CLKDIV;                /**< LPI2C3 clock divider control, offset: 0x254 */
  __IO uint32_t MRCC_LPI2C4_CLKSEL;                /**< LPI2C4 clock selection control, offset: 0x258 */
  __IO uint32_t MRCC_LPI2C4_CLKDIV;                /**< LPI2C4 clock divider control, offset: 0x25C */
  __IO uint32_t MRCC_LPUART5_CLKSEL;               /**< LPUART5 clock selection control, offset: 0x260 */
  __IO uint32_t MRCC_LPUART5_CLKDIV;               /**< LPUART5 clock divider control, offset: 0x264 */
  __IO uint32_t MRCC_I3C3_FCLK_CLKSEL;             /**< I3C3_FCLK clock selection control, offset: 0x268 */
  __IO uint32_t MRCC_I3C3_FCLK_CLKDIV;             /**< I3C3_FCLK clock divider control, offset: 0x26C */
  __IO uint32_t MRCC_DBG_TRACE_CLKSEL;             /**< DBG_TRACE clock selection control, offset: 0x270 */
  __IO uint32_t MRCC_DBG_TRACE_CLKDIV;             /**< DBG_TRACE clock divider control, offset: 0x274 */
  __IO uint32_t MRCC_CLKOUT_CLKSEL;                /**< CLKOUT clock selection control, offset: 0x278 */
  __IO uint32_t MRCC_CLKOUT_CLKDIV;                /**< CLKOUT clock divider control, offset: 0x27C */
  __IO uint32_t MRCC_SYSTICK_CLKSEL;               /**< SYSTICK clock selection control, offset: 0x280 */
  __IO uint32_t MRCC_SYSTICK_CLKDIV;               /**< SYSTICK clock divider control, offset: 0x284 */
} MRCC_Type;

/* ----------------------------------------------------------------------------
   -- MRCC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MRCC_Register_Masks MRCC Register Masks
 * @{
 */

/*! @name MRCC_GLB_RST0 - Peripheral Reset Control 0 */
/*! @{ */

#define MRCC_MRCC_GLB_RST0_INPUTMUX0_MASK        (0x1U)
#define MRCC_MRCC_GLB_RST0_INPUTMUX0_SHIFT       (0U)
/*! INPUTMUX0 - INPUTMUX0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST0_INPUTMUX0(x)          (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST0_INPUTMUX0_SHIFT)) & MRCC_MRCC_GLB_RST0_INPUTMUX0_MASK)

