zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_MRCC.h
#define MRCC_MRCC_GLB_RST1_PORT4_MASK            (0x4000U)
#define MRCC_MRCC_GLB_RST1_PORT4_SHIFT           (14U)
/*! PORT4 - PORT4
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST1_PORT4(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST1_PORT4_SHIFT)) & MRCC_MRCC_GLB_RST1_PORT4_MASK)

#define MRCC_MRCC_GLB_RST1_ADC0_MASK             (0x10000U)
#define MRCC_MRCC_GLB_RST1_ADC0_SHIFT            (16U)
/*! ADC0 - ADC0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST1_ADC0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST1_ADC0_SHIFT)) & MRCC_MRCC_GLB_RST1_ADC0_MASK)

#define MRCC_MRCC_GLB_RST1_ADC1_MASK             (0x20000U)
#define MRCC_MRCC_GLB_RST1_ADC1_SHIFT            (17U)
/*! ADC1 - ADC1
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST1_ADC1(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST1_ADC1_SHIFT)) & MRCC_MRCC_GLB_RST1_ADC1_MASK)

#define MRCC_MRCC_GLB_RST1_DAC0_MASK             (0x800000U)
#define MRCC_MRCC_GLB_RST1_DAC0_SHIFT            (23U)
/*! DAC0 - DAC0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST1_DAC0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST1_DAC0_SHIFT)) & MRCC_MRCC_GLB_RST1_DAC0_MASK)

#define MRCC_MRCC_GLB_RST1_DAC1_MASK             (0x1000000U)
#define MRCC_MRCC_GLB_RST1_DAC1_SHIFT            (24U)
/*! DAC1 - DAC1
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST1_DAC1(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST1_DAC1_SHIFT)) & MRCC_MRCC_GLB_RST1_DAC1_MASK)

#define MRCC_MRCC_GLB_RST1_VREF0_MASK            (0x20000000U)
#define MRCC_MRCC_GLB_RST1_VREF0_SHIFT           (29U)
/*! VREF0 - VREF0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST1_VREF0(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST1_VREF0_SHIFT)) & MRCC_MRCC_GLB_RST1_VREF0_MASK)
/*! @} */

/*! @name MRCC_GLB_RST1_SET - Peripheral Reset Control Set 1 */
/*! @{ */

#define MRCC_MRCC_GLB_RST1_SET_DATA_MASK         (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_RST1_SET_DATA_SHIFT        (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_RSTn. */
#define MRCC_MRCC_GLB_RST1_SET_DATA(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST1_SET_DATA_SHIFT)) & MRCC_MRCC_GLB_RST1_SET_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_RST1_CLR - Peripheral Reset Control Clear 1 */
/*! @{ */

#define MRCC_MRCC_GLB_RST1_CLR_DATA_MASK         (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_RST1_CLR_DATA_SHIFT        (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_RSTn. */
#define MRCC_MRCC_GLB_RST1_CLR_DATA(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST1_CLR_DATA_SHIFT)) & MRCC_MRCC_GLB_RST1_CLR_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_RST2 - Peripheral Reset Control 2 */
/*! @{ */

#define MRCC_MRCC_GLB_RST2_I3C0_MASK             (0x1U)
#define MRCC_MRCC_GLB_RST2_I3C0_SHIFT            (0U)
/*! I3C0 - I3C0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST2_I3C0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_I3C0_SHIFT)) & MRCC_MRCC_GLB_RST2_I3C0_MASK)

#define MRCC_MRCC_GLB_RST2_I3C1_MASK             (0x2U)
#define MRCC_MRCC_GLB_RST2_I3C1_SHIFT            (1U)
/*! I3C1 - I3C1
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST2_I3C1(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_I3C1_SHIFT)) & MRCC_MRCC_GLB_RST2_I3C1_MASK)

#define MRCC_MRCC_GLB_RST2_I3C2_MASK             (0x4U)
#define MRCC_MRCC_GLB_RST2_I3C2_SHIFT            (2U)
/*! I3C2 - I3C2
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST2_I3C2(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_I3C2_SHIFT)) & MRCC_MRCC_GLB_RST2_I3C2_MASK)

#define MRCC_MRCC_GLB_RST2_I3C3_MASK             (0x8U)
#define MRCC_MRCC_GLB_RST2_I3C3_SHIFT            (3U)
/*! I3C3 - I3C3
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST2_I3C3(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_I3C3_SHIFT)) & MRCC_MRCC_GLB_RST2_I3C3_MASK)

#define MRCC_MRCC_GLB_RST2_FLEXCAN0_MASK         (0x10U)
#define MRCC_MRCC_GLB_RST2_FLEXCAN0_SHIFT        (4U)
/*! FLEXCAN0 - FLEXCAN0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST2_FLEXCAN0(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_FLEXCAN0_SHIFT)) & MRCC_MRCC_GLB_RST2_FLEXCAN0_MASK)

#define MRCC_MRCC_GLB_RST2_FLEXCAN1_MASK         (0x20U)
#define MRCC_MRCC_GLB_RST2_FLEXCAN1_SHIFT        (5U)
/*! FLEXCAN1 - FLEXCAN1
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST2_FLEXCAN1(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_FLEXCAN1_SHIFT)) & MRCC_MRCC_GLB_RST2_FLEXCAN1_MASK)

#define MRCC_MRCC_GLB_RST2_ENET0_MASK            (0x400U)
#define MRCC_MRCC_GLB_RST2_ENET0_SHIFT           (10U)
/*! ENET0 - ENET0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST2_ENET0(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_ENET0_SHIFT)) & MRCC_MRCC_GLB_RST2_ENET0_MASK)

#define MRCC_MRCC_GLB_RST2_T1S0_MASK             (0x800U)
#define MRCC_MRCC_GLB_RST2_T1S0_SHIFT            (11U)
/*! T1S0 - T1S0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST2_T1S0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_T1S0_SHIFT)) & MRCC_MRCC_GLB_RST2_T1S0_MASK)

#define MRCC_MRCC_GLB_RST2_FLEXSPI0_MASK         (0x1000U)
#define MRCC_MRCC_GLB_RST2_FLEXSPI0_SHIFT        (12U)
/*! FLEXSPI0 - FLEXSPI0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST2_FLEXSPI0(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_FLEXSPI0_SHIFT)) & MRCC_MRCC_GLB_RST2_FLEXSPI0_MASK)

#define MRCC_MRCC_GLB_RST2_SPI0_FILTER_MASK      (0x2000U)
#define MRCC_MRCC_GLB_RST2_SPI0_FILTER_SHIFT     (13U)
/*! SPI0_FILTER - SPI0_FILTER
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST2_SPI0_FILTER(x)        (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_SPI0_FILTER_SHIFT)) & MRCC_MRCC_GLB_RST2_SPI0_FILTER_MASK)

#define MRCC_MRCC_GLB_RST2_ESPI0_MASK            (0x4000U)
#define MRCC_MRCC_GLB_RST2_ESPI0_SHIFT           (14U)
/*! ESPI0 - ESPI0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST2_ESPI0(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_ESPI0_SHIFT)) & MRCC_MRCC_GLB_RST2_ESPI0_MASK)

#define MRCC_MRCC_GLB_RST2_USB1_MASK             (0x40000U)
#define MRCC_MRCC_GLB_RST2_USB1_SHIFT            (18U)
/*! USB1 - USB1
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST2_USB1(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_USB1_SHIFT)) & MRCC_MRCC_GLB_RST2_USB1_MASK)

#define MRCC_MRCC_GLB_RST2_USB1_PHY_MASK         (0x80000U)
#define MRCC_MRCC_GLB_RST2_USB1_PHY_SHIFT        (19U)
/*! USB1_PHY - USB1_PHY
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST2_USB1_PHY(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_USB1_PHY_SHIFT)) & MRCC_MRCC_GLB_RST2_USB1_PHY_MASK)

#define MRCC_MRCC_GLB_RST2_EWM0_MASK             (0x100000U)
#define MRCC_MRCC_GLB_RST2_EWM0_SHIFT            (20U)
/*! EWM0 - EWM0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST2_EWM0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_EWM0_SHIFT)) & MRCC_MRCC_GLB_RST2_EWM0_MASK)
/*! @} */

/*! @name MRCC_GLB_RST2_SET - Peripheral Reset Control Set 2 */
/*! @{ */

#define MRCC_MRCC_GLB_RST2_SET_DATA_MASK         (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_RST2_SET_DATA_SHIFT        (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_RSTn. */
#define MRCC_MRCC_GLB_RST2_SET_DATA(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_SET_DATA_SHIFT)) & MRCC_MRCC_GLB_RST2_SET_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_RST2_CLR - Peripheral Reset Control Clear 2 */
/*! @{ */

