zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_MRCC.h
#define MRCC_MRCC_GLB_RST2_CLR_DATA_MASK         (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_RST2_CLR_DATA_SHIFT        (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_RSTn. */
#define MRCC_MRCC_GLB_RST2_CLR_DATA(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST2_CLR_DATA_SHIFT)) & MRCC_MRCC_GLB_RST2_CLR_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_RST3 - Peripheral Reset Control 3 */
/*! @{ */

#define MRCC_MRCC_GLB_RST3_GPIO0_MASK            (0x100000U)
#define MRCC_MRCC_GLB_RST3_GPIO0_SHIFT           (20U)
/*! GPIO0 - GPIO0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST3_GPIO0(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST3_GPIO0_SHIFT)) & MRCC_MRCC_GLB_RST3_GPIO0_MASK)

#define MRCC_MRCC_GLB_RST3_GPIO1_MASK            (0x200000U)
#define MRCC_MRCC_GLB_RST3_GPIO1_SHIFT           (21U)
/*! GPIO1 - GPIO1
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST3_GPIO1(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST3_GPIO1_SHIFT)) & MRCC_MRCC_GLB_RST3_GPIO1_MASK)

#define MRCC_MRCC_GLB_RST3_GPIO2_MASK            (0x400000U)
#define MRCC_MRCC_GLB_RST3_GPIO2_SHIFT           (22U)
/*! GPIO2 - GPIO2
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST3_GPIO2(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST3_GPIO2_SHIFT)) & MRCC_MRCC_GLB_RST3_GPIO2_MASK)

#define MRCC_MRCC_GLB_RST3_GPIO3_MASK            (0x800000U)
#define MRCC_MRCC_GLB_RST3_GPIO3_SHIFT           (23U)
/*! GPIO3 - GPIO3
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST3_GPIO3(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST3_GPIO3_SHIFT)) & MRCC_MRCC_GLB_RST3_GPIO3_MASK)

#define MRCC_MRCC_GLB_RST3_GPIO4_MASK            (0x1000000U)
#define MRCC_MRCC_GLB_RST3_GPIO4_SHIFT           (24U)
/*! GPIO4 - GPIO4
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST3_GPIO4(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST3_GPIO4_SHIFT)) & MRCC_MRCC_GLB_RST3_GPIO4_MASK)

#define MRCC_MRCC_GLB_RST3_SMARTDMA0_MASK        (0x20000000U)
#define MRCC_MRCC_GLB_RST3_SMARTDMA0_SHIFT       (29U)
/*! SMARTDMA0 - SMARTDMA0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST3_SMARTDMA0(x)          (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST3_SMARTDMA0_SHIFT)) & MRCC_MRCC_GLB_RST3_SMARTDMA0_MASK)
/*! @} */

/*! @name MRCC_GLB_RST3_SET - Peripheral Reset Control Set 3 */
/*! @{ */

#define MRCC_MRCC_GLB_RST3_SET_DATA_MASK         (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_RST3_SET_DATA_SHIFT        (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_RSTn. */
#define MRCC_MRCC_GLB_RST3_SET_DATA(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST3_SET_DATA_SHIFT)) & MRCC_MRCC_GLB_RST3_SET_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_RST3_CLR - Peripheral Reset Control Clear 3 */
/*! @{ */

#define MRCC_MRCC_GLB_RST3_CLR_DATA_MASK         (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_RST3_CLR_DATA_SHIFT        (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_RSTn. */
#define MRCC_MRCC_GLB_RST3_CLR_DATA(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST3_CLR_DATA_SHIFT)) & MRCC_MRCC_GLB_RST3_CLR_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_RST4 - Peripheral Reset Control 4 */
/*! @{ */

#define MRCC_MRCC_GLB_RST4_GLIKEY0_MASK          (0x20000U)
#define MRCC_MRCC_GLB_RST4_GLIKEY0_SHIFT         (17U)
/*! GLIKEY0 - GLIKEY0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST4_GLIKEY0(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST4_GLIKEY0_SHIFT)) & MRCC_MRCC_GLB_RST4_GLIKEY0_MASK)

#define MRCC_MRCC_GLB_RST4_PKC0_MASK             (0x80000U)
#define MRCC_MRCC_GLB_RST4_PKC0_SHIFT            (19U)
/*! PKC0 - PKC0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST4_PKC0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST4_PKC0_SHIFT)) & MRCC_MRCC_GLB_RST4_PKC0_MASK)

#define MRCC_MRCC_GLB_RST4_TRNG0_MASK            (0x200000U)
#define MRCC_MRCC_GLB_RST4_TRNG0_SHIFT           (21U)
/*! TRNG0 - TRNG0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST4_TRNG0(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST4_TRNG0_SHIFT)) & MRCC_MRCC_GLB_RST4_TRNG0_MASK)

#define MRCC_MRCC_GLB_RST4_DGDET0_MASK           (0x800000U)
#define MRCC_MRCC_GLB_RST4_DGDET0_SHIFT          (23U)
/*! DGDET0 - DGDET0
 *  0b0..Peripheral is held in reset
 *  0b1..Peripheral is released from reset
 */
#define MRCC_MRCC_GLB_RST4_DGDET0(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST4_DGDET0_SHIFT)) & MRCC_MRCC_GLB_RST4_DGDET0_MASK)
/*! @} */

/*! @name MRCC_GLB_RST4_SET - Peripheral Reset Control Set 4 */
/*! @{ */

#define MRCC_MRCC_GLB_RST4_SET_DATA_MASK         (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_RST4_SET_DATA_SHIFT        (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_RSTn. */
#define MRCC_MRCC_GLB_RST4_SET_DATA(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST4_SET_DATA_SHIFT)) & MRCC_MRCC_GLB_RST4_SET_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_RST4_CLR - Peripheral Reset Control Clear 4 */
/*! @{ */

#define MRCC_MRCC_GLB_RST4_CLR_DATA_MASK         (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_RST4_CLR_DATA_SHIFT        (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_RSTn. */
#define MRCC_MRCC_GLB_RST4_CLR_DATA(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_RST4_CLR_DATA_SHIFT)) & MRCC_MRCC_GLB_RST4_CLR_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_CC0 - AHB Clock Control 0 */
/*! @{ */

#define MRCC_MRCC_GLB_CC0_INPUTMUX0_MASK         (0x1U)
#define MRCC_MRCC_GLB_CC0_INPUTMUX0_SHIFT        (0U)
/*! INPUTMUX0 - INPUTMUX0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC0_INPUTMUX0(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC0_INPUTMUX0_SHIFT)) & MRCC_MRCC_GLB_CC0_INPUTMUX0_MASK)

#define MRCC_MRCC_GLB_CC0_FREQME_MASK            (0x2U)
#define MRCC_MRCC_GLB_CC0_FREQME_SHIFT           (1U)
/*! FREQME - FREQME
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC0_FREQME(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC0_FREQME_SHIFT)) & MRCC_MRCC_GLB_CC0_FREQME_MASK)

#define MRCC_MRCC_GLB_CC0_CTIMER0_MASK           (0x4U)
#define MRCC_MRCC_GLB_CC0_CTIMER0_SHIFT          (2U)
/*! CTIMER0 - CTIMER0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC0_CTIMER0(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC0_CTIMER0_SHIFT)) & MRCC_MRCC_GLB_CC0_CTIMER0_MASK)

#define MRCC_MRCC_GLB_CC0_CTIMER1_MASK           (0x8U)
#define MRCC_MRCC_GLB_CC0_CTIMER1_SHIFT          (3U)
/*! CTIMER1 - CTIMER1
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC0_CTIMER1(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC0_CTIMER1_SHIFT)) & MRCC_MRCC_GLB_CC0_CTIMER1_MASK)

