zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_MRCC.h
#define MRCC_MRCC_GLB_CC1_DAC0_MASK              (0x800000U)
#define MRCC_MRCC_GLB_CC1_DAC0_SHIFT             (23U)
/*! DAC0 - DAC0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_DAC0(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_DAC0_SHIFT)) & MRCC_MRCC_GLB_CC1_DAC0_MASK)

#define MRCC_MRCC_GLB_CC1_DAC1_MASK              (0x1000000U)
#define MRCC_MRCC_GLB_CC1_DAC1_SHIFT             (24U)
/*! DAC1 - DAC1
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_DAC1(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_DAC1_SHIFT)) & MRCC_MRCC_GLB_CC1_DAC1_MASK)

#define MRCC_MRCC_GLB_CC1_VREF0_MASK             (0x20000000U)
#define MRCC_MRCC_GLB_CC1_VREF0_SHIFT            (29U)
/*! VREF0 - VREF0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_VREF0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_VREF0_SHIFT)) & MRCC_MRCC_GLB_CC1_VREF0_MASK)

#define MRCC_MRCC_GLB_CC1_TSI0_MASK              (0x80000000U)
#define MRCC_MRCC_GLB_CC1_TSI0_SHIFT             (31U)
/*! TSI0 - TSI0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC1_TSI0(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_TSI0_SHIFT)) & MRCC_MRCC_GLB_CC1_TSI0_MASK)
/*! @} */

/*! @name MRCC_GLB_CC1_SET - AHB Clock Control Set 1 */
/*! @{ */

#define MRCC_MRCC_GLB_CC1_SET_DATA_MASK          (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_CC1_SET_DATA_SHIFT         (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_CCn. */
#define MRCC_MRCC_GLB_CC1_SET_DATA(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_SET_DATA_SHIFT)) & MRCC_MRCC_GLB_CC1_SET_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_CC1_CLR - AHB Clock Control Clear 1 */
/*! @{ */

#define MRCC_MRCC_GLB_CC1_CLR_DATA_MASK          (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_CC1_CLR_DATA_SHIFT         (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_CCn. */
#define MRCC_MRCC_GLB_CC1_CLR_DATA(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC1_CLR_DATA_SHIFT)) & MRCC_MRCC_GLB_CC1_CLR_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_CC2 - AHB Clock Control 2 */
/*! @{ */

#define MRCC_MRCC_GLB_CC2_I3C0_MASK              (0x1U)
#define MRCC_MRCC_GLB_CC2_I3C0_SHIFT             (0U)
/*! I3C0 - I3C0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_I3C0(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_I3C0_SHIFT)) & MRCC_MRCC_GLB_CC2_I3C0_MASK)

#define MRCC_MRCC_GLB_CC2_I3C1_MASK              (0x2U)
#define MRCC_MRCC_GLB_CC2_I3C1_SHIFT             (1U)
/*! I3C1 - I3C1
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_I3C1(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_I3C1_SHIFT)) & MRCC_MRCC_GLB_CC2_I3C1_MASK)

#define MRCC_MRCC_GLB_CC2_I3C2_MASK              (0x4U)
#define MRCC_MRCC_GLB_CC2_I3C2_SHIFT             (2U)
/*! I3C2 - I3C2
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_I3C2(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_I3C2_SHIFT)) & MRCC_MRCC_GLB_CC2_I3C2_MASK)

#define MRCC_MRCC_GLB_CC2_I3C3_MASK              (0x8U)
#define MRCC_MRCC_GLB_CC2_I3C3_SHIFT             (3U)
/*! I3C3 - I3C3
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_I3C3(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_I3C3_SHIFT)) & MRCC_MRCC_GLB_CC2_I3C3_MASK)

#define MRCC_MRCC_GLB_CC2_FLEXCAN0_MASK          (0x10U)
#define MRCC_MRCC_GLB_CC2_FLEXCAN0_SHIFT         (4U)
/*! FLEXCAN0 - FLEXCAN0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_FLEXCAN0(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_FLEXCAN0_SHIFT)) & MRCC_MRCC_GLB_CC2_FLEXCAN0_MASK)

#define MRCC_MRCC_GLB_CC2_FLEXCAN1_MASK          (0x20U)
#define MRCC_MRCC_GLB_CC2_FLEXCAN1_SHIFT         (5U)
/*! FLEXCAN1 - FLEXCAN1
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_FLEXCAN1(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_FLEXCAN1_SHIFT)) & MRCC_MRCC_GLB_CC2_FLEXCAN1_MASK)

#define MRCC_MRCC_GLB_CC2_E1588_MASK             (0x100U)
#define MRCC_MRCC_GLB_CC2_E1588_SHIFT            (8U)
/*! E1588 - E1588
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_E1588(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_E1588_SHIFT)) & MRCC_MRCC_GLB_CC2_E1588_MASK)

#define MRCC_MRCC_GLB_CC2_RMII_MASK              (0x200U)
#define MRCC_MRCC_GLB_CC2_RMII_SHIFT             (9U)
/*! RMII - RMII
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_RMII(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_RMII_SHIFT)) & MRCC_MRCC_GLB_CC2_RMII_MASK)

#define MRCC_MRCC_GLB_CC2_ENET0_MASK             (0x400U)
#define MRCC_MRCC_GLB_CC2_ENET0_SHIFT            (10U)
/*! ENET0 - ENET0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_ENET0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_ENET0_SHIFT)) & MRCC_MRCC_GLB_CC2_ENET0_MASK)

#define MRCC_MRCC_GLB_CC2_T1S0_MASK              (0x800U)
#define MRCC_MRCC_GLB_CC2_T1S0_SHIFT             (11U)
/*! T1S0 - T1S0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_T1S0(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_T1S0_SHIFT)) & MRCC_MRCC_GLB_CC2_T1S0_MASK)

#define MRCC_MRCC_GLB_CC2_FLEXSPI0_MASK          (0x1000U)
#define MRCC_MRCC_GLB_CC2_FLEXSPI0_SHIFT         (12U)
/*! FLEXSPI0 - FLEXSPI0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_FLEXSPI0(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_FLEXSPI0_SHIFT)) & MRCC_MRCC_GLB_CC2_FLEXSPI0_MASK)

