zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_MRCC.h
#define MRCC_MRCC_GLB_CC2_SPI0_FILTER_MASK       (0x2000U)
#define MRCC_MRCC_GLB_CC2_SPI0_FILTER_SHIFT      (13U)
/*! SPI0_FILTER - SPI0_FILTER
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_SPI0_FILTER(x)         (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_SPI0_FILTER_SHIFT)) & MRCC_MRCC_GLB_CC2_SPI0_FILTER_MASK)

#define MRCC_MRCC_GLB_CC2_ESPI0_MASK             (0x4000U)
#define MRCC_MRCC_GLB_CC2_ESPI0_SHIFT            (14U)
/*! ESPI0 - ESPI0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_ESPI0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_ESPI0_SHIFT)) & MRCC_MRCC_GLB_CC2_ESPI0_MASK)

#define MRCC_MRCC_GLB_CC2_USB1_MASK              (0x40000U)
#define MRCC_MRCC_GLB_CC2_USB1_SHIFT             (18U)
/*! USB1 - USB1
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_USB1(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_USB1_SHIFT)) & MRCC_MRCC_GLB_CC2_USB1_MASK)

#define MRCC_MRCC_GLB_CC2_USB1_PHY_MASK          (0x80000U)
#define MRCC_MRCC_GLB_CC2_USB1_PHY_SHIFT         (19U)
/*! USB1_PHY - USB1_PHY
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_USB1_PHY(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_USB1_PHY_SHIFT)) & MRCC_MRCC_GLB_CC2_USB1_PHY_MASK)

#define MRCC_MRCC_GLB_CC2_EWM0_MASK              (0x100000U)
#define MRCC_MRCC_GLB_CC2_EWM0_SHIFT             (20U)
/*! EWM0 - EWM0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC2_EWM0(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_EWM0_SHIFT)) & MRCC_MRCC_GLB_CC2_EWM0_MASK)
/*! @} */

/*! @name MRCC_GLB_CC2_SET - AHB Clock Control Set 2 */
/*! @{ */

#define MRCC_MRCC_GLB_CC2_SET_DATA_MASK          (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_CC2_SET_DATA_SHIFT         (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_CCn. */
#define MRCC_MRCC_GLB_CC2_SET_DATA(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_SET_DATA_SHIFT)) & MRCC_MRCC_GLB_CC2_SET_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_CC2_CLR - AHB Clock Control Clear 2 */
/*! @{ */

#define MRCC_MRCC_GLB_CC2_CLR_DATA_MASK          (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_CC2_CLR_DATA_SHIFT         (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_CCn. */
#define MRCC_MRCC_GLB_CC2_CLR_DATA(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC2_CLR_DATA_SHIFT)) & MRCC_MRCC_GLB_CC2_CLR_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_CC3 - AHB Clock Control 3 */
/*! @{ */

#define MRCC_MRCC_GLB_CC3_RAMA_MASK              (0x10000U)
#define MRCC_MRCC_GLB_CC3_RAMA_SHIFT             (16U)
/*! RAMA - RAMA
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC3_RAMA(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC3_RAMA_SHIFT)) & MRCC_MRCC_GLB_CC3_RAMA_MASK)

#define MRCC_MRCC_GLB_CC3_RAMB_MASK              (0x20000U)
#define MRCC_MRCC_GLB_CC3_RAMB_SHIFT             (17U)
/*! RAMB - RAMB
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC3_RAMB(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC3_RAMB_SHIFT)) & MRCC_MRCC_GLB_CC3_RAMB_MASK)

#define MRCC_MRCC_GLB_CC3_GPIO0_MASK             (0x100000U)
#define MRCC_MRCC_GLB_CC3_GPIO0_SHIFT            (20U)
/*! GPIO0 - GPIO0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC3_GPIO0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC3_GPIO0_SHIFT)) & MRCC_MRCC_GLB_CC3_GPIO0_MASK)

#define MRCC_MRCC_GLB_CC3_GPIO1_MASK             (0x200000U)
#define MRCC_MRCC_GLB_CC3_GPIO1_SHIFT            (21U)
/*! GPIO1 - GPIO1
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC3_GPIO1(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC3_GPIO1_SHIFT)) & MRCC_MRCC_GLB_CC3_GPIO1_MASK)

#define MRCC_MRCC_GLB_CC3_GPIO2_MASK             (0x400000U)
#define MRCC_MRCC_GLB_CC3_GPIO2_SHIFT            (22U)
/*! GPIO2 - GPIO2
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC3_GPIO2(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC3_GPIO2_SHIFT)) & MRCC_MRCC_GLB_CC3_GPIO2_MASK)

#define MRCC_MRCC_GLB_CC3_GPIO3_MASK             (0x800000U)
#define MRCC_MRCC_GLB_CC3_GPIO3_SHIFT            (23U)
/*! GPIO3 - GPIO3
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC3_GPIO3(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC3_GPIO3_SHIFT)) & MRCC_MRCC_GLB_CC3_GPIO3_MASK)

#define MRCC_MRCC_GLB_CC3_GPIO4_MASK             (0x1000000U)
#define MRCC_MRCC_GLB_CC3_GPIO4_SHIFT            (24U)
/*! GPIO4 - GPIO4
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC3_GPIO4(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC3_GPIO4_SHIFT)) & MRCC_MRCC_GLB_CC3_GPIO4_MASK)

#define MRCC_MRCC_GLB_CC3_GPIO5_MASK             (0x2000000U)
#define MRCC_MRCC_GLB_CC3_GPIO5_SHIFT            (25U)
/*! GPIO5 - GPIO5
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC3_GPIO5(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC3_GPIO5_SHIFT)) & MRCC_MRCC_GLB_CC3_GPIO5_MASK)

#define MRCC_MRCC_GLB_CC3_ROMC_MASK              (0x10000000U)
#define MRCC_MRCC_GLB_CC3_ROMC_SHIFT             (28U)
/*! ROMC - ROMC
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC3_ROMC(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC3_ROMC_SHIFT)) & MRCC_MRCC_GLB_CC3_ROMC_MASK)

#define MRCC_MRCC_GLB_CC3_SMARTDMA0_MASK         (0x20000000U)
#define MRCC_MRCC_GLB_CC3_SMARTDMA0_SHIFT        (29U)
/*! SMARTDMA0 - SMARTDMA0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC3_SMARTDMA0(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC3_SMARTDMA0_SHIFT)) & MRCC_MRCC_GLB_CC3_SMARTDMA0_MASK)
/*! @} */

/*! @name MRCC_GLB_CC3_SET - AHB Clock Control Set 3 */
/*! @{ */

#define MRCC_MRCC_GLB_CC3_SET_DATA_MASK          (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_CC3_SET_DATA_SHIFT         (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_CCn. */
#define MRCC_MRCC_GLB_CC3_SET_DATA(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC3_SET_DATA_SHIFT)) & MRCC_MRCC_GLB_CC3_SET_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_CC3_CLR - AHB Clock Control Clear 3 */
/*! @{ */

