zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_MRCC.h
#define MRCC_MRCC_GLB_CC3_CLR_DATA_MASK          (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_CC3_CLR_DATA_SHIFT         (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_CCn. */
#define MRCC_MRCC_GLB_CC3_CLR_DATA(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC3_CLR_DATA_SHIFT)) & MRCC_MRCC_GLB_CC3_CLR_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_CC4 - AHB Clock Control 4 */
/*! @{ */

#define MRCC_MRCC_GLB_CC4_SECCON_MASK            (0x10000U)
#define MRCC_MRCC_GLB_CC4_SECCON_SHIFT           (16U)
/*! SECCON - SECCON
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC4_SECCON(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC4_SECCON_SHIFT)) & MRCC_MRCC_GLB_CC4_SECCON_MASK)

#define MRCC_MRCC_GLB_CC4_GLIKEY0_MASK           (0x20000U)
#define MRCC_MRCC_GLB_CC4_GLIKEY0_SHIFT          (17U)
/*! GLIKEY0 - GLIKEY0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC4_GLIKEY0(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC4_GLIKEY0_SHIFT)) & MRCC_MRCC_GLB_CC4_GLIKEY0_MASK)

#define MRCC_MRCC_GLB_CC4_TDET0_MASK             (0x40000U)
#define MRCC_MRCC_GLB_CC4_TDET0_SHIFT            (18U)
/*! TDET0 - TDET0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC4_TDET0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC4_TDET0_SHIFT)) & MRCC_MRCC_GLB_CC4_TDET0_MASK)

#define MRCC_MRCC_GLB_CC4_PKC0_MASK              (0x80000U)
#define MRCC_MRCC_GLB_CC4_PKC0_SHIFT             (19U)
/*! PKC0 - PKC0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC4_PKC0(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC4_PKC0_SHIFT)) & MRCC_MRCC_GLB_CC4_PKC0_MASK)

#define MRCC_MRCC_GLB_CC4_SGI0_MASK              (0x100000U)
#define MRCC_MRCC_GLB_CC4_SGI0_SHIFT             (20U)
/*! SGI0 - SGI0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC4_SGI0(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC4_SGI0_SHIFT)) & MRCC_MRCC_GLB_CC4_SGI0_MASK)

#define MRCC_MRCC_GLB_CC4_TRNG0_MASK             (0x200000U)
#define MRCC_MRCC_GLB_CC4_TRNG0_SHIFT            (21U)
/*! TRNG0 - TRNG0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC4_TRNG0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC4_TRNG0_SHIFT)) & MRCC_MRCC_GLB_CC4_TRNG0_MASK)

#define MRCC_MRCC_GLB_CC4_UDF0_MASK              (0x400000U)
#define MRCC_MRCC_GLB_CC4_UDF0_SHIFT             (22U)
/*! UDF0 - UDF0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC4_UDF0(x)                (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC4_UDF0_SHIFT)) & MRCC_MRCC_GLB_CC4_UDF0_MASK)

#define MRCC_MRCC_GLB_CC4_DGDET0_MASK            (0x800000U)
#define MRCC_MRCC_GLB_CC4_DGDET0_SHIFT           (23U)
/*! DGDET0 - DGDET0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC4_DGDET0(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC4_DGDET0_SHIFT)) & MRCC_MRCC_GLB_CC4_DGDET0_MASK)

#define MRCC_MRCC_GLB_CC4_ITRC0_MASK             (0x1000000U)
#define MRCC_MRCC_GLB_CC4_ITRC0_SHIFT            (24U)
/*! ITRC0 - ITRC0
 *  0b0..Peripheral clock is disabled
 *  0b1..Peripheral clock is enabled
 */
#define MRCC_MRCC_GLB_CC4_ITRC0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC4_ITRC0_SHIFT)) & MRCC_MRCC_GLB_CC4_ITRC0_MASK)
/*! @} */

/*! @name MRCC_GLB_CC4_SET - AHB Clock Control Set 4 */
/*! @{ */

#define MRCC_MRCC_GLB_CC4_SET_DATA_MASK          (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_CC4_SET_DATA_SHIFT         (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_CCn. */
#define MRCC_MRCC_GLB_CC4_SET_DATA(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC4_SET_DATA_SHIFT)) & MRCC_MRCC_GLB_CC4_SET_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_CC4_CLR - AHB Clock Control Clear 4 */
/*! @{ */

#define MRCC_MRCC_GLB_CC4_CLR_DATA_MASK          (0xFFFFFFFFU)
#define MRCC_MRCC_GLB_CC4_CLR_DATA_SHIFT         (0U)
/*! DATA - Data array value, refer to corresponding position in MRCC_GLB_CCn. */
#define MRCC_MRCC_GLB_CC4_CLR_DATA(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_CC4_CLR_DATA_SHIFT)) & MRCC_MRCC_GLB_CC4_CLR_DATA_MASK)
/*! @} */

/*! @name MRCC_GLB_ACC0 - Control Automatic Clock Gating 0 */
/*! @{ */

#define MRCC_MRCC_GLB_ACC0_INPUTMUX0_MASK        (0x1U)
#define MRCC_MRCC_GLB_ACC0_INPUTMUX0_SHIFT       (0U)
/*! INPUTMUX0 - INPUTMUX0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC0_INPUTMUX0(x)          (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC0_INPUTMUX0_SHIFT)) & MRCC_MRCC_GLB_ACC0_INPUTMUX0_MASK)

#define MRCC_MRCC_GLB_ACC0_FREQME_MASK           (0x2U)
#define MRCC_MRCC_GLB_ACC0_FREQME_SHIFT          (1U)
/*! FREQME - FREQME
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC0_FREQME(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC0_FREQME_SHIFT)) & MRCC_MRCC_GLB_ACC0_FREQME_MASK)

#define MRCC_MRCC_GLB_ACC0_CTIMER0_MASK          (0x4U)
#define MRCC_MRCC_GLB_ACC0_CTIMER0_SHIFT         (2U)
/*! CTIMER0 - CTIMER0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC0_CTIMER0(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC0_CTIMER0_SHIFT)) & MRCC_MRCC_GLB_ACC0_CTIMER0_MASK)

#define MRCC_MRCC_GLB_ACC0_CTIMER1_MASK          (0x8U)
#define MRCC_MRCC_GLB_ACC0_CTIMER1_SHIFT         (3U)
/*! CTIMER1 - CTIMER1
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC0_CTIMER1(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC0_CTIMER1_SHIFT)) & MRCC_MRCC_GLB_ACC0_CTIMER1_MASK)

#define MRCC_MRCC_GLB_ACC0_CTIMER2_MASK          (0x10U)
#define MRCC_MRCC_GLB_ACC0_CTIMER2_SHIFT         (4U)
/*! CTIMER2 - CTIMER2
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC0_CTIMER2(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC0_CTIMER2_SHIFT)) & MRCC_MRCC_GLB_ACC0_CTIMER2_MASK)

#define MRCC_MRCC_GLB_ACC0_CTIMER3_MASK          (0x20U)
#define MRCC_MRCC_GLB_ACC0_CTIMER3_SHIFT         (5U)
/*! CTIMER3 - CTIMER3
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC0_CTIMER3(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC0_CTIMER3_SHIFT)) & MRCC_MRCC_GLB_ACC0_CTIMER3_MASK)

#define MRCC_MRCC_GLB_ACC0_CTIMER4_MASK          (0x40U)
#define MRCC_MRCC_GLB_ACC0_CTIMER4_SHIFT         (6U)
/*! CTIMER4 - CTIMER4
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC0_CTIMER4(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC0_CTIMER4_SHIFT)) & MRCC_MRCC_GLB_ACC0_CTIMER4_MASK)

