zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_MRCC.h
#define MRCC_MRCC_GLB_ACC0_LPUART2_MASK          (0x8000000U)
#define MRCC_MRCC_GLB_ACC0_LPUART2_SHIFT         (27U)
/*! LPUART2 - LPUART2
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC0_LPUART2(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC0_LPUART2_SHIFT)) & MRCC_MRCC_GLB_ACC0_LPUART2_MASK)

#define MRCC_MRCC_GLB_ACC0_LPUART3_MASK          (0x10000000U)
#define MRCC_MRCC_GLB_ACC0_LPUART3_SHIFT         (28U)
/*! LPUART3 - LPUART3
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC0_LPUART3(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC0_LPUART3_SHIFT)) & MRCC_MRCC_GLB_ACC0_LPUART3_MASK)

#define MRCC_MRCC_GLB_ACC0_LPUART4_MASK          (0x20000000U)
#define MRCC_MRCC_GLB_ACC0_LPUART4_SHIFT         (29U)
/*! LPUART4 - LPUART4
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC0_LPUART4(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC0_LPUART4_SHIFT)) & MRCC_MRCC_GLB_ACC0_LPUART4_MASK)

#define MRCC_MRCC_GLB_ACC0_LPUART5_MASK          (0x40000000U)
#define MRCC_MRCC_GLB_ACC0_LPUART5_SHIFT         (30U)
/*! LPUART5 - LPUART5
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC0_LPUART5(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC0_LPUART5_SHIFT)) & MRCC_MRCC_GLB_ACC0_LPUART5_MASK)

#define MRCC_MRCC_GLB_ACC0_OSTIMER0_MASK         (0x80000000U)
#define MRCC_MRCC_GLB_ACC0_OSTIMER0_SHIFT        (31U)
/*! OSTIMER0 - OSTIMER0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC0_OSTIMER0(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC0_OSTIMER0_SHIFT)) & MRCC_MRCC_GLB_ACC0_OSTIMER0_MASK)
/*! @} */

/*! @name MRCC_GLB_ACC1 - Control Automatic Clock Gating 1 */
/*! @{ */

#define MRCC_MRCC_GLB_ACC1_LPSPI0_MASK           (0x10U)
#define MRCC_MRCC_GLB_ACC1_LPSPI0_SHIFT          (4U)
/*! LPSPI0 - LPSPI0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_LPSPI0(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_LPSPI0_SHIFT)) & MRCC_MRCC_GLB_ACC1_LPSPI0_MASK)

#define MRCC_MRCC_GLB_ACC1_LPSPI1_MASK           (0x20U)
#define MRCC_MRCC_GLB_ACC1_LPSPI1_SHIFT          (5U)
/*! LPSPI1 - LPSPI1
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_LPSPI1(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_LPSPI1_SHIFT)) & MRCC_MRCC_GLB_ACC1_LPSPI1_MASK)

#define MRCC_MRCC_GLB_ACC1_LPSPI2_MASK           (0x40U)
#define MRCC_MRCC_GLB_ACC1_LPSPI2_SHIFT          (6U)
/*! LPSPI2 - LPSPI2
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_LPSPI2(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_LPSPI2_SHIFT)) & MRCC_MRCC_GLB_ACC1_LPSPI2_MASK)

#define MRCC_MRCC_GLB_ACC1_LPSPI3_MASK           (0x80U)
#define MRCC_MRCC_GLB_ACC1_LPSPI3_SHIFT          (7U)
/*! LPSPI3 - LPSPI3
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_LPSPI3(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_LPSPI3_SHIFT)) & MRCC_MRCC_GLB_ACC1_LPSPI3_MASK)

#define MRCC_MRCC_GLB_ACC1_LPSPI4_MASK           (0x100U)
#define MRCC_MRCC_GLB_ACC1_LPSPI4_SHIFT          (8U)
/*! LPSPI4 - LPSPI4
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_LPSPI4(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_LPSPI4_SHIFT)) & MRCC_MRCC_GLB_ACC1_LPSPI4_MASK)

#define MRCC_MRCC_GLB_ACC1_LPSPI5_MASK           (0x200U)
#define MRCC_MRCC_GLB_ACC1_LPSPI5_SHIFT          (9U)
/*! LPSPI5 - LPSPI5
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_LPSPI5(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_LPSPI5_SHIFT)) & MRCC_MRCC_GLB_ACC1_LPSPI5_MASK)

#define MRCC_MRCC_GLB_ACC1_PORT0_MASK            (0x400U)
#define MRCC_MRCC_GLB_ACC1_PORT0_SHIFT           (10U)
/*! PORT0 - PORT0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_PORT0(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_PORT0_SHIFT)) & MRCC_MRCC_GLB_ACC1_PORT0_MASK)

#define MRCC_MRCC_GLB_ACC1_PORT1_MASK            (0x800U)
#define MRCC_MRCC_GLB_ACC1_PORT1_SHIFT           (11U)
/*! PORT1 - PORT1
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_PORT1(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_PORT1_SHIFT)) & MRCC_MRCC_GLB_ACC1_PORT1_MASK)

#define MRCC_MRCC_GLB_ACC1_PORT2_MASK            (0x1000U)
#define MRCC_MRCC_GLB_ACC1_PORT2_SHIFT           (12U)
/*! PORT2 - PORT2
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_PORT2(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_PORT2_SHIFT)) & MRCC_MRCC_GLB_ACC1_PORT2_MASK)

#define MRCC_MRCC_GLB_ACC1_PORT3_MASK            (0x2000U)
#define MRCC_MRCC_GLB_ACC1_PORT3_SHIFT           (13U)
/*! PORT3 - PORT3
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_PORT3(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_PORT3_SHIFT)) & MRCC_MRCC_GLB_ACC1_PORT3_MASK)

#define MRCC_MRCC_GLB_ACC1_PORT4_MASK            (0x4000U)
#define MRCC_MRCC_GLB_ACC1_PORT4_SHIFT           (14U)
/*! PORT4 - PORT4
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_PORT4(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_PORT4_SHIFT)) & MRCC_MRCC_GLB_ACC1_PORT4_MASK)

#define MRCC_MRCC_GLB_ACC1_ADC0_MASK             (0x10000U)
#define MRCC_MRCC_GLB_ACC1_ADC0_SHIFT            (16U)
/*! ADC0 - ADC0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_ADC0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_ADC0_SHIFT)) & MRCC_MRCC_GLB_ACC1_ADC0_MASK)

#define MRCC_MRCC_GLB_ACC1_ADC1_MASK             (0x20000U)
#define MRCC_MRCC_GLB_ACC1_ADC1_SHIFT            (17U)
/*! ADC1 - ADC1
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_ADC1(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_ADC1_SHIFT)) & MRCC_MRCC_GLB_ACC1_ADC1_MASK)

#define MRCC_MRCC_GLB_ACC1_CMP0_MASK             (0x100000U)
#define MRCC_MRCC_GLB_ACC1_CMP0_SHIFT            (20U)
/*! CMP0 - CMP0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_CMP0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_CMP0_SHIFT)) & MRCC_MRCC_GLB_ACC1_CMP0_MASK)

#define MRCC_MRCC_GLB_ACC1_DAC0_MASK             (0x800000U)
#define MRCC_MRCC_GLB_ACC1_DAC0_SHIFT            (23U)
/*! DAC0 - DAC0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_DAC0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_DAC0_SHIFT)) & MRCC_MRCC_GLB_ACC1_DAC0_MASK)

#define MRCC_MRCC_GLB_ACC1_DAC1_MASK             (0x1000000U)
#define MRCC_MRCC_GLB_ACC1_DAC1_SHIFT            (24U)
/*! DAC1 - DAC1
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_DAC1(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_DAC1_SHIFT)) & MRCC_MRCC_GLB_ACC1_DAC1_MASK)

#define MRCC_MRCC_GLB_ACC1_VREF0_MASK            (0x20000000U)
#define MRCC_MRCC_GLB_ACC1_VREF0_SHIFT           (29U)
/*! VREF0 - VREF0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_VREF0(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_VREF0_SHIFT)) & MRCC_MRCC_GLB_ACC1_VREF0_MASK)

#define MRCC_MRCC_GLB_ACC1_TSI0_MASK             (0x80000000U)
#define MRCC_MRCC_GLB_ACC1_TSI0_SHIFT            (31U)
/*! TSI0 - TSI0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC1_TSI0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC1_TSI0_SHIFT)) & MRCC_MRCC_GLB_ACC1_TSI0_MASK)
/*! @} */

/*! @name MRCC_GLB_ACC2 - Control Automatic Clock Gating 2 */
/*! @{ */

#define MRCC_MRCC_GLB_ACC2_I3C0_MASK             (0x1U)
#define MRCC_MRCC_GLB_ACC2_I3C0_SHIFT            (0U)
/*! I3C0 - I3C0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC2_I3C0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC2_I3C0_SHIFT)) & MRCC_MRCC_GLB_ACC2_I3C0_MASK)

#define MRCC_MRCC_GLB_ACC2_I3C1_MASK             (0x2U)
#define MRCC_MRCC_GLB_ACC2_I3C1_SHIFT            (1U)
/*! I3C1 - I3C1
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC2_I3C1(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC2_I3C1_SHIFT)) & MRCC_MRCC_GLB_ACC2_I3C1_MASK)

#define MRCC_MRCC_GLB_ACC2_I3C2_MASK             (0x4U)
#define MRCC_MRCC_GLB_ACC2_I3C2_SHIFT            (2U)
/*! I3C2 - I3C2
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC2_I3C2(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC2_I3C2_SHIFT)) & MRCC_MRCC_GLB_ACC2_I3C2_MASK)

#define MRCC_MRCC_GLB_ACC2_I3C3_MASK             (0x8U)
#define MRCC_MRCC_GLB_ACC2_I3C3_SHIFT            (3U)
/*! I3C3 - I3C3
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC2_I3C3(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC2_I3C3_SHIFT)) & MRCC_MRCC_GLB_ACC2_I3C3_MASK)

#define MRCC_MRCC_GLB_ACC2_FLEXCAN0_MASK         (0x10U)
#define MRCC_MRCC_GLB_ACC2_FLEXCAN0_SHIFT        (4U)
/*! FLEXCAN0 - FLEXCAN0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC2_FLEXCAN0(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC2_FLEXCAN0_SHIFT)) & MRCC_MRCC_GLB_ACC2_FLEXCAN0_MASK)

#define MRCC_MRCC_GLB_ACC2_FLEXCAN1_MASK         (0x20U)
#define MRCC_MRCC_GLB_ACC2_FLEXCAN1_SHIFT        (5U)
/*! FLEXCAN1 - FLEXCAN1
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC2_FLEXCAN1(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC2_FLEXCAN1_SHIFT)) & MRCC_MRCC_GLB_ACC2_FLEXCAN1_MASK)

#define MRCC_MRCC_GLB_ACC2_E1588_MASK            (0x100U)
#define MRCC_MRCC_GLB_ACC2_E1588_SHIFT           (8U)
/*! E1588 - E1588
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC2_E1588(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC2_E1588_SHIFT)) & MRCC_MRCC_GLB_ACC2_E1588_MASK)

