zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_MRCC.h
#define MRCC_MRCC_GLB_ACC4_SECCON_MASK           (0x10000U)
#define MRCC_MRCC_GLB_ACC4_SECCON_SHIFT          (16U)
/*! SECCON - SECCON
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC4_SECCON(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC4_SECCON_SHIFT)) & MRCC_MRCC_GLB_ACC4_SECCON_MASK)

#define MRCC_MRCC_GLB_ACC4_GLIKEY0_MASK          (0x20000U)
#define MRCC_MRCC_GLB_ACC4_GLIKEY0_SHIFT         (17U)
/*! GLIKEY0 - GLIKEY0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC4_GLIKEY0(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC4_GLIKEY0_SHIFT)) & MRCC_MRCC_GLB_ACC4_GLIKEY0_MASK)

#define MRCC_MRCC_GLB_ACC4_PKC0_MASK             (0x80000U)
#define MRCC_MRCC_GLB_ACC4_PKC0_SHIFT            (19U)
/*! PKC0 - PKC0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC4_PKC0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC4_PKC0_SHIFT)) & MRCC_MRCC_GLB_ACC4_PKC0_MASK)

#define MRCC_MRCC_GLB_ACC4_SGI0_MASK             (0x100000U)
#define MRCC_MRCC_GLB_ACC4_SGI0_SHIFT            (20U)
/*! SGI0 - SGI0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC4_SGI0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC4_SGI0_SHIFT)) & MRCC_MRCC_GLB_ACC4_SGI0_MASK)

#define MRCC_MRCC_GLB_ACC4_TRNG0_MASK            (0x200000U)
#define MRCC_MRCC_GLB_ACC4_TRNG0_SHIFT           (21U)
/*! TRNG0 - TRNG0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC4_TRNG0(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC4_TRNG0_SHIFT)) & MRCC_MRCC_GLB_ACC4_TRNG0_MASK)

#define MRCC_MRCC_GLB_ACC4_UDF0_MASK             (0x400000U)
#define MRCC_MRCC_GLB_ACC4_UDF0_SHIFT            (22U)
/*! UDF0 - UDF0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC4_UDF0(x)               (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC4_UDF0_SHIFT)) & MRCC_MRCC_GLB_ACC4_UDF0_MASK)

#define MRCC_MRCC_GLB_ACC4_DGDET0_MASK           (0x800000U)
#define MRCC_MRCC_GLB_ACC4_DGDET0_SHIFT          (23U)
/*! DGDET0 - DGDET0
 *  0b0..Automatic clock gating is disabled
 *  0b1..Automatic clock gating is enabled
 */
#define MRCC_MRCC_GLB_ACC4_DGDET0(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GLB_ACC4_DGDET0_SHIFT)) & MRCC_MRCC_GLB_ACC4_DGDET0_MASK)
/*! @} */

/*! @name MRCC_I3C0_FCLK_CLKSEL - I3C0_FCLK clock selection control */
/*! @{ */

#define MRCC_MRCC_I3C0_FCLK_CLKSEL_MUX_MASK      (0x7U)
#define MRCC_MRCC_I3C0_FCLK_CLKSEL_MUX_SHIFT     (0U)
/*! MUX - Functional Clock Mux Select
 *  0b000..FRO_LF_DIV
 *  0b010..FRO_HF_DIV
 *  0b011..CLK_IN
 *  0b101..CLK_1M
 *  0b110..PLL1_CLK_DIV
 *  0b111..Reserved(NO Clock)
 */
#define MRCC_MRCC_I3C0_FCLK_CLKSEL_MUX(x)        (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_I3C0_FCLK_CLKSEL_MUX_SHIFT)) & MRCC_MRCC_I3C0_FCLK_CLKSEL_MUX_MASK)
/*! @} */

/*! @name MRCC_I3C0_FCLK_CLKDIV - I3C0_FCLK clock divider control */
/*! @{ */

#define MRCC_MRCC_I3C0_FCLK_CLKDIV_DIV_MASK      (0xFU)
#define MRCC_MRCC_I3C0_FCLK_CLKDIV_DIV_SHIFT     (0U)
/*! DIV - Functional Clock Divider */
#define MRCC_MRCC_I3C0_FCLK_CLKDIV_DIV(x)        (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_I3C0_FCLK_CLKDIV_DIV_SHIFT)) & MRCC_MRCC_I3C0_FCLK_CLKDIV_DIV_MASK)

#define MRCC_MRCC_I3C0_FCLK_CLKDIV_RESET_MASK    (0x20000000U)
#define MRCC_MRCC_I3C0_FCLK_CLKDIV_RESET_SHIFT   (29U)
/*! RESET - Reset divider counter
 *  0b0..Divider isn't reset
 *  0b1..Divider is reset
 */
#define MRCC_MRCC_I3C0_FCLK_CLKDIV_RESET(x)      (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_I3C0_FCLK_CLKDIV_RESET_SHIFT)) & MRCC_MRCC_I3C0_FCLK_CLKDIV_RESET_MASK)

#define MRCC_MRCC_I3C0_FCLK_CLKDIV_HALT_MASK     (0x40000000U)
#define MRCC_MRCC_I3C0_FCLK_CLKDIV_HALT_SHIFT    (30U)
/*! HALT - Halt divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define MRCC_MRCC_I3C0_FCLK_CLKDIV_HALT(x)       (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_I3C0_FCLK_CLKDIV_HALT_SHIFT)) & MRCC_MRCC_I3C0_FCLK_CLKDIV_HALT_MASK)

#define MRCC_MRCC_I3C0_FCLK_CLKDIV_UNSTAB_MASK   (0x80000000U)
#define MRCC_MRCC_I3C0_FCLK_CLKDIV_UNSTAB_SHIFT  (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency isn't stable
 */
#define MRCC_MRCC_I3C0_FCLK_CLKDIV_UNSTAB(x)     (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_I3C0_FCLK_CLKDIV_UNSTAB_SHIFT)) & MRCC_MRCC_I3C0_FCLK_CLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name MRCC_I3C1_FCLK_CLKSEL - I3C1_FCLK clock selection control */
/*! @{ */

#define MRCC_MRCC_I3C1_FCLK_CLKSEL_MUX_MASK      (0x7U)
#define MRCC_MRCC_I3C1_FCLK_CLKSEL_MUX_SHIFT     (0U)
/*! MUX - Functional Clock Mux Select
 *  0b000..FRO_LF_DIV
 *  0b010..FRO_HF_DIV
 *  0b011..CLK_IN
 *  0b101..CLK_1M
 *  0b110..PLL1_CLK_DIV
 *  0b111..Reserved(NO Clock)
 */
#define MRCC_MRCC_I3C1_FCLK_CLKSEL_MUX(x)        (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_I3C1_FCLK_CLKSEL_MUX_SHIFT)) & MRCC_MRCC_I3C1_FCLK_CLKSEL_MUX_MASK)
/*! @} */

/*! @name MRCC_I3C1_FCLK_CLKDIV - I3C1_FCLK clock divider control */
/*! @{ */

#define MRCC_MRCC_I3C1_FCLK_CLKDIV_DIV_MASK      (0xFU)
#define MRCC_MRCC_I3C1_FCLK_CLKDIV_DIV_SHIFT     (0U)
/*! DIV - Functional Clock Divider */
#define MRCC_MRCC_I3C1_FCLK_CLKDIV_DIV(x)        (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_I3C1_FCLK_CLKDIV_DIV_SHIFT)) & MRCC_MRCC_I3C1_FCLK_CLKDIV_DIV_MASK)

#define MRCC_MRCC_I3C1_FCLK_CLKDIV_RESET_MASK    (0x20000000U)
#define MRCC_MRCC_I3C1_FCLK_CLKDIV_RESET_SHIFT   (29U)
/*! RESET - Reset divider counter
 *  0b0..Divider isn't reset
 *  0b1..Divider is reset
 */
#define MRCC_MRCC_I3C1_FCLK_CLKDIV_RESET(x)      (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_I3C1_FCLK_CLKDIV_RESET_SHIFT)) & MRCC_MRCC_I3C1_FCLK_CLKDIV_RESET_MASK)

#define MRCC_MRCC_I3C1_FCLK_CLKDIV_HALT_MASK     (0x40000000U)
#define MRCC_MRCC_I3C1_FCLK_CLKDIV_HALT_SHIFT    (30U)
/*! HALT - Halt divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define MRCC_MRCC_I3C1_FCLK_CLKDIV_HALT(x)       (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_I3C1_FCLK_CLKDIV_HALT_SHIFT)) & MRCC_MRCC_I3C1_FCLK_CLKDIV_HALT_MASK)

