zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_MRCC.h
#define MRCC_MRCC_FLEXSPI0_CLKDIV_HALT_MASK      (0x40000000U)
#define MRCC_MRCC_FLEXSPI0_CLKDIV_HALT_SHIFT     (30U)
/*! HALT - Halt divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define MRCC_MRCC_FLEXSPI0_CLKDIV_HALT(x)        (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_FLEXSPI0_CLKDIV_HALT_SHIFT)) & MRCC_MRCC_FLEXSPI0_CLKDIV_HALT_MASK)

#define MRCC_MRCC_FLEXSPI0_CLKDIV_UNSTAB_MASK    (0x80000000U)
#define MRCC_MRCC_FLEXSPI0_CLKDIV_UNSTAB_SHIFT   (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency isn't stable
 */
#define MRCC_MRCC_FLEXSPI0_CLKDIV_UNSTAB(x)      (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_FLEXSPI0_CLKDIV_UNSTAB_SHIFT)) & MRCC_MRCC_FLEXSPI0_CLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name MRCC_LPSPI2_CLKSEL - LPSPI2 clock selection control */
/*! @{ */

#define MRCC_MRCC_LPSPI2_CLKSEL_MUX_MASK         (0x7U)
#define MRCC_MRCC_LPSPI2_CLKSEL_MUX_SHIFT        (0U)
/*! MUX - Functional Clock Mux Select
 *  0b000..FRO_LF_DIV
 *  0b010..FRO_HF_DIV
 *  0b011..CLK_IN
 *  0b101..CLK_1M
 *  0b110..PLL1_CLK_DIV
 *  0b111..Reserved(NO Clock)
 */
#define MRCC_MRCC_LPSPI2_CLKSEL_MUX(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI2_CLKSEL_MUX_SHIFT)) & MRCC_MRCC_LPSPI2_CLKSEL_MUX_MASK)
/*! @} */

/*! @name MRCC_LPSPI2_CLKDIV - LPSPI2 clock divider control */
/*! @{ */

#define MRCC_MRCC_LPSPI2_CLKDIV_DIV_MASK         (0xFU)
#define MRCC_MRCC_LPSPI2_CLKDIV_DIV_SHIFT        (0U)
/*! DIV - Functional Clock Divider */
#define MRCC_MRCC_LPSPI2_CLKDIV_DIV(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI2_CLKDIV_DIV_SHIFT)) & MRCC_MRCC_LPSPI2_CLKDIV_DIV_MASK)

#define MRCC_MRCC_LPSPI2_CLKDIV_RESET_MASK       (0x20000000U)
#define MRCC_MRCC_LPSPI2_CLKDIV_RESET_SHIFT      (29U)
/*! RESET - Reset divider counter
 *  0b0..Divider isn't reset
 *  0b1..Divider is reset
 */
#define MRCC_MRCC_LPSPI2_CLKDIV_RESET(x)         (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI2_CLKDIV_RESET_SHIFT)) & MRCC_MRCC_LPSPI2_CLKDIV_RESET_MASK)

#define MRCC_MRCC_LPSPI2_CLKDIV_HALT_MASK        (0x40000000U)
#define MRCC_MRCC_LPSPI2_CLKDIV_HALT_SHIFT       (30U)
/*! HALT - Halt divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define MRCC_MRCC_LPSPI2_CLKDIV_HALT(x)          (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI2_CLKDIV_HALT_SHIFT)) & MRCC_MRCC_LPSPI2_CLKDIV_HALT_MASK)

#define MRCC_MRCC_LPSPI2_CLKDIV_UNSTAB_MASK      (0x80000000U)
#define MRCC_MRCC_LPSPI2_CLKDIV_UNSTAB_SHIFT     (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency isn't stable
 */
#define MRCC_MRCC_LPSPI2_CLKDIV_UNSTAB(x)        (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI2_CLKDIV_UNSTAB_SHIFT)) & MRCC_MRCC_LPSPI2_CLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name MRCC_LPSPI3_CLKSEL - LPSPI3 clock selection control */
/*! @{ */

#define MRCC_MRCC_LPSPI3_CLKSEL_MUX_MASK         (0x7U)
#define MRCC_MRCC_LPSPI3_CLKSEL_MUX_SHIFT        (0U)
/*! MUX - Functional Clock Mux Select
 *  0b000..FRO_LF_DIV
 *  0b010..FRO_HF_DIV
 *  0b011..CLK_IN
 *  0b101..CLK_1M
 *  0b110..PLL1_CLK_DIV
 *  0b111..Reserved(NO Clock)
 */
#define MRCC_MRCC_LPSPI3_CLKSEL_MUX(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI3_CLKSEL_MUX_SHIFT)) & MRCC_MRCC_LPSPI3_CLKSEL_MUX_MASK)
/*! @} */

/*! @name MRCC_LPSPI3_CLKDIV - LPSPI3 clock divider control */
/*! @{ */

#define MRCC_MRCC_LPSPI3_CLKDIV_DIV_MASK         (0xFU)
#define MRCC_MRCC_LPSPI3_CLKDIV_DIV_SHIFT        (0U)
/*! DIV - Functional Clock Divider */
#define MRCC_MRCC_LPSPI3_CLKDIV_DIV(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI3_CLKDIV_DIV_SHIFT)) & MRCC_MRCC_LPSPI3_CLKDIV_DIV_MASK)

#define MRCC_MRCC_LPSPI3_CLKDIV_RESET_MASK       (0x20000000U)
#define MRCC_MRCC_LPSPI3_CLKDIV_RESET_SHIFT      (29U)
/*! RESET - Reset divider counter
 *  0b0..Divider isn't reset
 *  0b1..Divider is reset
 */
#define MRCC_MRCC_LPSPI3_CLKDIV_RESET(x)         (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI3_CLKDIV_RESET_SHIFT)) & MRCC_MRCC_LPSPI3_CLKDIV_RESET_MASK)

#define MRCC_MRCC_LPSPI3_CLKDIV_HALT_MASK        (0x40000000U)
#define MRCC_MRCC_LPSPI3_CLKDIV_HALT_SHIFT       (30U)
/*! HALT - Halt divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define MRCC_MRCC_LPSPI3_CLKDIV_HALT(x)          (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI3_CLKDIV_HALT_SHIFT)) & MRCC_MRCC_LPSPI3_CLKDIV_HALT_MASK)

#define MRCC_MRCC_LPSPI3_CLKDIV_UNSTAB_MASK      (0x80000000U)
#define MRCC_MRCC_LPSPI3_CLKDIV_UNSTAB_SHIFT     (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency isn't stable
 */
#define MRCC_MRCC_LPSPI3_CLKDIV_UNSTAB(x)        (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI3_CLKDIV_UNSTAB_SHIFT)) & MRCC_MRCC_LPSPI3_CLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name MRCC_LPSPI4_CLKSEL - LPSPI4 clock selection control */
/*! @{ */

#define MRCC_MRCC_LPSPI4_CLKSEL_MUX_MASK         (0x7U)
#define MRCC_MRCC_LPSPI4_CLKSEL_MUX_SHIFT        (0U)
/*! MUX - Functional Clock Mux Select
 *  0b000..FRO_LF_DIV
 *  0b010..FRO_HF_DIV
 *  0b011..CLK_IN
 *  0b101..CLK_1M
 *  0b110..PLL1_CLK_DIV
 *  0b111..Reserved(NO Clock)
 */
#define MRCC_MRCC_LPSPI4_CLKSEL_MUX(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI4_CLKSEL_MUX_SHIFT)) & MRCC_MRCC_LPSPI4_CLKSEL_MUX_MASK)
/*! @} */

/*! @name MRCC_LPSPI4_CLKDIV - LPSPI4 clock divider control */
/*! @{ */

#define MRCC_MRCC_LPSPI4_CLKDIV_DIV_MASK         (0xFU)
#define MRCC_MRCC_LPSPI4_CLKDIV_DIV_SHIFT        (0U)
/*! DIV - Functional Clock Divider */
#define MRCC_MRCC_LPSPI4_CLKDIV_DIV(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI4_CLKDIV_DIV_SHIFT)) & MRCC_MRCC_LPSPI4_CLKDIV_DIV_MASK)

#define MRCC_MRCC_LPSPI4_CLKDIV_RESET_MASK       (0x20000000U)
#define MRCC_MRCC_LPSPI4_CLKDIV_RESET_SHIFT      (29U)
/*! RESET - Reset divider counter
 *  0b0..Divider isn't reset
 *  0b1..Divider is reset
 */
#define MRCC_MRCC_LPSPI4_CLKDIV_RESET(x)         (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI4_CLKDIV_RESET_SHIFT)) & MRCC_MRCC_LPSPI4_CLKDIV_RESET_MASK)

#define MRCC_MRCC_LPSPI4_CLKDIV_HALT_MASK        (0x40000000U)
#define MRCC_MRCC_LPSPI4_CLKDIV_HALT_SHIFT       (30U)
/*! HALT - Halt divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define MRCC_MRCC_LPSPI4_CLKDIV_HALT(x)          (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI4_CLKDIV_HALT_SHIFT)) & MRCC_MRCC_LPSPI4_CLKDIV_HALT_MASK)

#define MRCC_MRCC_LPSPI4_CLKDIV_UNSTAB_MASK      (0x80000000U)
#define MRCC_MRCC_LPSPI4_CLKDIV_UNSTAB_SHIFT     (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..Clock frequency isn't stable
 */
#define MRCC_MRCC_LPSPI4_CLKDIV_UNSTAB(x)        (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI4_CLKDIV_UNSTAB_SHIFT)) & MRCC_MRCC_LPSPI4_CLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name MRCC_LPSPI5_CLKSEL - LPSPI5 clock selection control */
/*! @{ */

#define MRCC_MRCC_LPSPI5_CLKSEL_MUX_MASK         (0x7U)
#define MRCC_MRCC_LPSPI5_CLKSEL_MUX_SHIFT        (0U)
/*! MUX - Functional Clock Mux Select
 *  0b000..FRO_LF_DIV
 *  0b010..FRO_HF_DIV
 *  0b011..CLK_IN
 *  0b101..CLK_1M
 *  0b110..PLL1_CLK_DIV
 *  0b111..Reserved(NO Clock)
 */
#define MRCC_MRCC_LPSPI5_CLKSEL_MUX(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI5_CLKSEL_MUX_SHIFT)) & MRCC_MRCC_LPSPI5_CLKSEL_MUX_MASK)
/*! @} */

/*! @name MRCC_LPSPI5_CLKDIV - LPSPI5 clock divider control */
/*! @{ */

#define MRCC_MRCC_LPSPI5_CLKDIV_DIV_MASK         (0xFU)
#define MRCC_MRCC_LPSPI5_CLKDIV_DIV_SHIFT        (0U)
/*! DIV - Functional Clock Divider */
#define MRCC_MRCC_LPSPI5_CLKDIV_DIV(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI5_CLKDIV_DIV_SHIFT)) & MRCC_MRCC_LPSPI5_CLKDIV_DIV_MASK)

#define MRCC_MRCC_LPSPI5_CLKDIV_RESET_MASK       (0x20000000U)
#define MRCC_MRCC_LPSPI5_CLKDIV_RESET_SHIFT      (29U)
/*! RESET - Reset divider counter
 *  0b0..Divider isn't reset
 *  0b1..Divider is reset
 */
#define MRCC_MRCC_LPSPI5_CLKDIV_RESET(x)         (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI5_CLKDIV_RESET_SHIFT)) & MRCC_MRCC_LPSPI5_CLKDIV_RESET_MASK)

#define MRCC_MRCC_LPSPI5_CLKDIV_HALT_MASK        (0x40000000U)
#define MRCC_MRCC_LPSPI5_CLKDIV_HALT_SHIFT       (30U)
/*! HALT - Halt divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define MRCC_MRCC_LPSPI5_CLKDIV_HALT(x)          (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI5_CLKDIV_HALT_SHIFT)) & MRCC_MRCC_LPSPI5_CLKDIV_HALT_MASK)

